aramcon-badge/Adafruit_nRF52_Arduino/boards.txt
# Debug Menu
cluenrf52840.menu.debug.l0=Level 0 (Release)
cluenrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
cluenrf52840.menu.debug.l1=Level 1 (Error Message)
cluenrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
cluenrf52840.menu.debug.l2=Level 2 (Full Debug)
cluenrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
cluenrf52840.menu.debug.l3=Level 3 (Segger SystemView)
cluenrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
cluenrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Bluefruit Metro nRF52840 Express
# ----------------------------------
metro52840.name=Adafruit Bluefruit Metro nRF52840 Express

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
metro52840.vid.0=0x239A
metro52840.pid.0=0x803F
metro52840.vid.1=0x239A
metro52840.pid.1=0x003F
metro52840.vid.2=0x239A
metro52840.pid.2=0x0040
metro52840.vid.3=0x239A
metro52840.pid.3=0x8040

# Upload
metro52840.bootloader.tool=bootburn
metro52840.upload.tool=nrfutil
metro52840.upload.protocol=nrfutil
metro52840.upload.use_1200bps_touch=true
metro52840.upload.wait_for_upload_port=true
metro52840.upload.maximum_size=815104
metro52840.upload.maximum_data_size=237568

# Build
metro52840.build.mcu=cortex-m4
metro52840.build.f_cpu=64000000
metro52840.build.board=NRF52840_METRO
metro52840.build.core=nRF5
metro52840.build.variant=metro_nrf52840_express
metro52840.build.usb_manufacturer="Adafruit LLC"
metro52840.build.usb_product="Metro nRF52840 Express"
metro52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
metro52840.build.ldscript=nrf52840_s140_v6.ld
metro52840.build.vid=0x239A
metro52840.build.pid=0x803F

# SofDevice Menu
metro52840.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
metro52840.menu.softdevice.s140v6.build.sd_name=s140
metro52840.menu.softdevice.s140v6.build.sd_version=6.1.1
metro52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
metro52840.menu.debug.l0=Level 0 (Release)
metro52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
metro52840.menu.debug.l1=Level 1 (Error Message)
metro52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
metro52840.menu.debug.l2=Level 2 (Full Debug)
metro52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
metro52840.menu.debug.l3=Level 3 (Segger SystemView)
metro52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
metro52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1




# -------------------------------------------------------
# 
# Boards that aren't made by Adafruit
#
# -------------------------------------------------------


# ---------------------------------------------
# AramCon Badge 2020
# ---------------------------------------------
aramcon_badge_2020.name=AramCon Badge 2020

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
aramcon_badge_2020.vid.0=0x239A
aramcon_badge_2020.pid.0=0x807B
aramcon_badge_2020.vid.1=0x239A
aramcon_badge_2020.pid.1=0x007B
aramcon_badge_2020.vid.2=0x239A
aramcon_badge_2020.pid.2=0x807C 
aramcon_badge_2020.vid.3=0x239A
aramcon_badge_2020.pid.3=0x007C 

# Upload
aramcon_badge_2020.bootloader.tool=bootburn
aramcon_badge_2020.upload.tool=nrfutil
aramcon_badge_2020.upload.protocol=nrfutil
aramcon_badge_2020.upload.use_1200bps_touch=true
aramcon_badge_2020.upload.wait_for_upload_port=true
aramcon_badge_2020.upload.maximum_size=815104
aramcon_badge_2020.upload.maximum_data_size=237568

# Build
aramcon_badge_2020.build.mcu=cortex-m4
aramcon_badge_2020.build.f_cpu=64000000
aramcon_badge_2020.build.board=ARAMCON_BADGE_2020
aramcon_badge_2020.build.core=nRF5
aramcon_badge_2020.build.variant=aramcon_badge_2020
aramcon_badge_2020.build.usb_manufacturer="CodeMagic"
aramcon_badge_2020.build.usb_product="AramCon Badge 2020"
aramcon_badge_2020.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
aramcon_badge_2020.build.ldscript=nrf52840_s140_v6.ld
aramcon_badge_2020.build.vid=0x239A
aramcon_badge_2020.build.pid=0x807B

# SofDevice Menu
aramcon_badge_2020.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
aramcon_badge_2020.menu.softdevice.s140v6.build.sd_name=s140
aramcon_badge_2020.menu.softdevice.s140v6.build.sd_version=6.1.1
aramcon_badge_2020.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
aramcon_badge_2020.menu.debug.l0=Level 0 (Release)
aramcon_badge_2020.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
aramcon_badge_2020.menu.debug.l1=Level 1 (Error Message)
aramcon_badge_2020.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
aramcon_badge_2020.menu.debug.l2=Level 2 (Full Debug)
aramcon_badge_2020.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
aramcon_badge_2020.menu.debug.l3=Level 3 (Segger SystemView)
aramcon_badge_2020.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
aramcon_badge_2020.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# ----------------------------------
# Nordic nRF52840DK (PCA10056)
# ----------------------------------
pca10056.name=Nordic nRF52840DK (PCA10056)
pca10056.bootloader.tool=bootburn

# Upload
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.vid=0x239A
pca10056.build.pid=0x8029

# SofDevice Menu
pca10056.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
pca10056.menu.debug.l0=Level 0 (Release)
pca10056.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10056.menu.debug.l1=Level 1 (Error Message)
pca10056.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10056.menu.debug.l2=Level 2 (Full Debug)
pca10056.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10056.menu.debug.l3=Level 3 (Segger SystemView)
pca10056.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10056.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Particle Xenon
# ----------------------------------
particle_xenon.name=Particle Xenon

